// "use strict";

// // ==================== 1 ========================
// // Напиши функцию findBestEmployee(employees), которая принимает объект сотрудников
// // и возвращает имя самого продуктивного (который выполнил больше всех задач).
// // Сотрудники и кол-во выполненых задач содержатся как свойства объекта
// // в формате "имя":"кол-во задач".

// const findBestEmployee = function (employees) {
//   // твой код
//   // =============== MINE ====================
//   const arrOfEntries = Object.entries(employees);
//   //   return arrOfEntries.reduce((max, n) => (n[1] > max[1] ? n : max)).join(`: `);
//   return arrOfEntries.sort((a, b) => b[1] - a[1])[0];
//   // =============== MINE ====================
// };

// // Вызовы функции для проверки работоспособности твоей реализации.
// console.log(
//   findBestEmployee({
//     ann: 29,
//     david: 35,
//     helen: 1,
//     lorence: 99,
//   })
// ); // lorence

// console.log(
//   findBestEmployee({
//     poly: 12,
//     mango: 17,
//     ajax: 4,
//   })
// ); // mango

// console.log(
//   findBestEmployee({
//     lux: 147,
//     david: 21,
//     kiwi: 19,
//     chelsy: 38,
//   })
// ); // lux

// // ==================== 2 ========================
// // Напиши функцию getAllPropValues(arr, prop), которая получает
// // массив объектов и имя свойства. Возвращает массив значений
// // определенного свойства prop из каждого объекта в массиве.

// const products = [
//     { name: "Радар", price: 1300, quantity: 4 },
//     { name: "Сканер", price: 2700, quantity: 3 },
//     { name: "Дроид", price: 400, quantity: 7 },
//     { name: "Захват", price: 1200, quantity: 2 },
//   ];

//   const getAllPropValues = function (arr, prop) {
//     // твой код
//     // =============== MINE ====================
//     return arr.reduce(function (result, item) {
//       if (
//         result.indexOf(item[prop]) == -1 && // if need unique values
//         typeof item[prop] != "undefined"
//       )
//         // if don't want undefined's
//         result.push(item[prop]);
//       return result;
//     }, []);
//     // =============== MINE ====================
//   };

//   // Вызовы функции для проверки работоспособности твоей реализации.

//   console.log(getAllPropValues(products, "name")); // ['Радар', 'Сканер', 'Дроид', 'Захват']
//   console.log(getAllPropValues(products, "quantity")); // [4, 3, 7, 2]
//   console.log(getAllPropValues(products, "category")); // []

// // ==================== 3 ========================
// // Напиши скрипт управления личным кабинетом интернет банка.
// // Есть объект account в котором необходимо реализовать методы
// // для работы с балансом и историей транзакций.

// /*
//  * Типов транзацкий всего два.
//  * Можно положить либо снять деньги со счета.
//  */
// const Transaction = {
//   DEPOSIT: 'deposit',
//   WITHDRAW: 'withdraw',
// };

// /*
//  * Каждая транзакция это объект со свойствами: id, type и amount
//  */

// const account = {
//   // Текущий баланс счета
//   balance: 0,

//   // История транзакций
//   transactions: [],

//   /*
//    * Метод создает и возвращает объект транзакции.
//    * Принимает сумму и тип транзакции.
//    */
//   createTransaction(amount, type) {},

//   /*
//    * Метод отвечающий за добавление суммы к балансу.
//    * Принимает сумму танзакции.
//    * Вызывает createTransaction для создания объекта транзакции
//    * после чего добавляет его в историю транзакций
//    */
//   deposit(amount) {},

//   /*
//    * Метод отвечающий за снятие суммы с баланса.
//    * Принимает сумму танзакции.
//    * Вызывает createTransaction для создания объекта транзакции
//    * после чего добавляет его в историю транзакций.
//    *
//    * Если amount больше чем текущий баланс, выводи сообщение
//    * о том, что снятие такой суммы не возможно, недостаточно средств.
//    */
//   withdraw(amount) {},

//   /*
//    * Метод возвращает текущий баланс
//    */
//   getBalance() {},

//   /*
//    * Метод ищет и возвращает объект транзации по id
//    */
//   getTransactionDetails(id) {},

//   /*
//    * Метод возвращает количество средств
//    * определенного типа транзакции из всей истории транзакций
//    */
//   getTransactionTotal(type) {},
// };
