"use strict";

// ============== 1 ===============================================
// Создай массив authors с именами авторов:
// William Shakespeare, Guy de Maupassant, Dante Alighieri, Mikhail Bulgakov, Albert Camus, Erich Maria Remarque
// С помощью методов массива, добавь в конец массива authors три элемента со значениями:
// Honore de Balzac, Miguel de Cervantes, Anton Chekhov
// а в начало массива, три элемента со значениями:
// Charles Dickens, Edgar Allan Poe, Gabriel Garcia Marquez
// Выведи обновленный массив в консоль.
// в комментарии после команды консоль укажи количесвто элементов измененного массива

// ============== 2 ===============================================
// Создай массив scores с элементами:
// 12, 32, 15, 17, 3, 4, 98, 67, 532, 611, 7, 100, 42
// с помощью методов массива shift() и pop(), удали первые два и последние три элемента
// Выведи результат в консоль

// ============== 3 ===============================================
// Создай массив results с элементами:
// 12, 32, 15, 17, 3, 4, 98, 67, 532, 611, 7, 100, 42
// с помощью метода splice(), удали первые два и последние три элемента, записав удаленные элементы
// в отдельные массивы removeFromStart и removeFromEnd
// Выведи в консоль все массивы

// ============== 4 ===============================================
// Создай массив partOfResults и скопируй в него элементы от 3 до 532 включительно
// из измененного массива results из задания 3
// (т.е. все задание 3 и массив results должны быть раскомментированы)

// ============== 5 ===============================================
// Создай массив doubleResults и скопируй в него все элементы
// из измененного массива results из задания 3

// ============== 6 ===============================================
// Перебери массив doubleResults из задания 5
// Четные числа из массива запиши в новый массив evenResults, а
// Нечетные - в oddResults
// В обратной последовательности в обоих случаях
// Выведи в консоль массивы evenResults и oddResults

// ============== 7 ===============================================
// Объедините массивы oddResults и evenResults из задания 6, записав их в новый массив AllResults
// Перебери новый массив AllResults и выбери только те элементы массива,
// которые содержат 1 и запиши эти элементы в новый массив includesOne
// "обрати внимание, что массив includesOne должен содержать элемента с типом number, а не string!

