"use strict";

// Напиши скрипт проверки количества товаров на складе.
// Есть переменные total (количество товаров на складе) и
// ordered (единиц товара в заказе).
// Сравни эти значения и по результатам выведи:
// __MCE_ITEM____MCE_ITEM__·
// Если в заказе указано число, превышающее количество товаров на складе,
// то выведи сообщение "На складе недостаточно товаров!".
// __MCE_ITEM____MCE_ITEM__·
// В другом случае выводи сообщение "Заказ оформлен, с вами свяжется менеджер".
// Проверь работоспособность кода с разными значениями переменной ordered,
// например 20, 80 и 130.

// const total = 100;

// const ordered = 50;

// let total1 = 20;
// let ordered1 = 19;
// if (ordered1 > total1) {
//   console.log("На складе недостаточно товаров");
// } else {
//   console.log("Заказ оформлен, с вами свяжется менеджер");
// }

// let total2 = 20;
// let ordered2 = 21;
// if (ordered2 > total2) {
//   console.log("На складе недостаточно товаров");
// } else {
//   console.log("Заказ оформлен, с вами свяжется менеджер");
// }

